better diagrams
